In [0]:
import pandas as pd
import matplotlib.pyplot as plt

In [103]:
#making dataframe from the given file location
df = pd.read_csv('http://13.234.66.67/summer19/datasets/info.csv')
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [104]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
Country      10 non-null object
Age          9 non-null float64
Salary       9 non-null float64
Purchased    10 non-null object
dtypes: float64(2), object(2)
memory usage: 400.0+ bytes

In [0]:
from sklearn.preprocessing import Imputer

In [106]:
imp = Imputer(missing_values='NaN',strategy='mean', axis=0)

/usr/local/lib/python3.6/dist-packages/sklearn/utils/deprecation.py:66: DeprecationWarning: Class Imputer is deprecated; Imputer was deprecated in version 0.20 and will be removed in 0.22. Import impute.SimpleImputer from sklearn instead.
  warnings.warn(msg, category=DeprecationWarning)

In [107]:
#converting the data into ndarray
x=df.iloc[:,0:].values
x

array([['France', 44.0, 72000.0, 'No'],
       ['Spain', 27.0, 48000.0, 'Yes'],
       ['Germany', 30.0, 54000.0, 'No'],
       ['Spain', 38.0, 61000.0, 'No'],
       ['Germany', 40.0, nan, 'Yes'],
       ['France', 35.0, 58000.0, 'Yes'],
       ['Spain', nan, 52000.0, 'No'],
       ['France', 48.0, 79000.0, 'Yes'],
       ['Germany', 50.0, 83000.0, 'No'],
       ['France', 37.0, 67000.0, 'Yes']], dtype=object)

In [108]:
#fitting column that we wanna process
impute=imp.fit(x[:,1:3])
impute

Imputer(axis=0, copy=True, missing_values='NaN', strategy='mean', verbose=0)

In [109]:
x[:,1:3] =impute.transform(x[:,1:3])
x

array([['France', 44.0, 72000.0, 'No'],
       ['Spain', 27.0, 48000.0, 'Yes'],
       ['Germany', 30.0, 54000.0, 'No'],
       ['Spain', 38.0, 61000.0, 'No'],
       ['Germany', 40.0, 63777.77777777778, 'Yes'],
       ['France', 35.0, 58000.0, 'Yes'],
       ['Spain', 38.77777777777778, 52000.0, 'No'],
       ['France', 48.0, 79000.0, 'Yes'],
       ['Germany', 50.0, 83000.0, 'No'],
       ['France', 37.0, 67000.0, 'Yes']], dtype=object)

In [110]:
# making mean with pandas dataframe

df['Age'].fillna(df['Age'].mean())

0    44.000000
1    27.000000
2    30.000000
3    38.000000
4    40.000000
5    35.000000
6    38.777778
7    48.000000
8    50.000000
9    37.000000
Name: Age, dtype: float64

In [111]:

ages=df[["Age"]]
print(type(ages))
#df2=ages.to_frame()
#df1 = pd.DataFrame('ages':ages)
#type(df['ages'])

<class 'pandas.core.frame.DataFrame'>

In [112]:
#df['ages'].reshape(-1,1)

x11=imp.fit_transform(ages)
x11

print(type(x11))
df2=pd.DataFrame(x11, index=x11[:,0])

df2

<class 'numpy.ndarray'>

                   0
44.000000  44.000000
27.000000  27.000000
30.000000  30.000000
38.000000  38.000000
40.000000  40.000000
35.000000  35.000000
38.777778  38.777778
48.000000  48.000000
50.000000  50.000000
37.000000  37.000000

In [0]:
cont = LabelEncoder()

In [0]:



# converting string to int / label



from sklearn.preprocessing import LabelEncoder

In [0]:
x[:,0]=cont.fit_transform(x[:,0])

In [0]:
# now converting last column 4
x[:,3]=cont.fit_transform(x[:,3])

In [0]:
# converting 1 column to multiple column in 0 and 1

from sklearn.preprocessing import OneHotEncoder

In [0]:
# defining the column number you wanna make category

firstcl = OneHotEncoder(categorical_features=[0])

In [123]:
# passing all data as we have already defined the column 

X=firstcl.fit_transform(x).toarray()

/usr/local/lib/python3.6/dist-packages/sklearn/preprocessing/_encoders.py:415: FutureWarning: The handling of integer data will change in version 0.22. Currently, the categories are determined based on the range [0, max(values)], while in the future they will be determined based on the unique values.
If you want the future behaviour and silence this warning, you can specify "categories='auto'".
In case you used a LabelEncoder before this OneHotEncoder to convert the categories to integers, then you can now use the OneHotEncoder directly.
  warnings.warn(msg, FutureWarning)
/usr/local/lib/python3.6/dist-packages/sklearn/preprocessing/_encoders.py:451: DeprecationWarning: The 'categorical_features' keyword is deprecated in version 0.20 and will be removed in 0.22. You can use the ColumnTransformer instead.
  "use the ColumnTransformer instead.", DeprecationWarning)

In [126]:

# value got it as this 
X



# converting X above value value to int

X.astype(int)

array([[    1,     0,     0,    44, 72000,     0],
       [    0,     0,     1,    27, 48000,     1],
       [    0,     1,     0,    30, 54000,     0],
       [    0,     0,     1,    38, 61000,     0],
       [    0,     1,     0,    40, 63777,     1],
       [    1,     0,     0,    35, 58000,     1],
       [    0,     0,     1,    38, 52000,     0],
       [    1,     0,     0,    48, 79000,     1],
       [    0,     1,     0,    50, 83000,     0],
       [    1,     0,     0,    37, 67000,     1]])

In [130]:
# making dataframe values into seprate columns

age_valueee = pd.get_dummies(df['Country'])
age_valueee

   France  Germany  Spain
0       1        0      0
1       0        0      1
2       0        1      0
3       0        0      1
4       0        1      0
5       1        0      0
6       0        0      1
7       1        0      0
8       0        1      0
9       1        0      0